TSD_TK/src/DataProcessors/ПанельМеню/ПанельМеню.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПанельМеню</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТовара2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеЕдиницы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоставщика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПодтверждено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВведено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРасхождение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРасхождения</name>
      <type>
        <types>EnumRef.ПричиныРасхождения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРасхожденияСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодХарактеристики</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Весовой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МРЦ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспМРЦ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРасхожденияПорядок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СканированиеТовар</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СканированиеЦенник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПроверена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпецЦена</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеВозврата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЦенник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриемДо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Артикул2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>ТипДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументUUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>55</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрагентUUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладUUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Инфо</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проведен</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Акт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПринято</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоставщика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументЗакрыт</name>
      <comment>0 - новый 1 - закрыт частично 2 - закрыт полностью</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИсполнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаданиеПроцесса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

TSD_TK/src/Catalogs/ТипыДокументов/ТипыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыДокументов</name>
  <predefined>
    <items>
      <name>БезакцептныйПрием</name>
      <description>Безакцептне приймання</description>
    </items>
    <items>
      <name>БезакцептныйПриемPKG</name>
      <description>Безакцептный Прием PKG</description>
    </items>
    <items>
      <name>ВыдачаДС</name>
      <description>Видача ДС</description>
    </items>
    <items>
      <name>ЗаданиеИН</name>
      <description>Завдання інв-ція</description>
    </items>
    <items>
      <name>Задание</name>
      <description>Задание</description>
    </items>
    <items>
      <name>ЗаданиеВФ</name>
      <description>Задание Верификация</description>
    </items>
    <items>
      <name>Zak</name>
      <description>Замовлення</description>
    </items>
    <items>
      <name>Заявка</name>
      <description>Заявка</description>
    </items>
    <items>
      <name>Инвентаризация</name>
      <description>Инвентаризация</description>
    </items>
    <items>
      <name>ИнвентаризацияТБД</name>
      <description>Инвентаризация ТБД</description>
    </items>
    <items>
      <name>Комплектация</name>
      <description>Комплектация</description>
    </items>
    <items>
      <name>Контролер</name>
      <description>Контролер</description>
    </items>
    <items>
      <name>ЛокальнаяИнвентаризация</name>
      <description>Локальная инвентаризация</description>
    </items>
    <items>
      <name>МаршрутныйЛист</name>
      <description>Маршрутный лист</description>
    </items>
    <items>
      <name>ЗаданиеТБД</name>
      <description>Не продається</description>
    </items>
    <items>
      <name>ПроверкаСтандартов</name>
      <description>Перевірка стандартів</description>
    </items>
    <items>
      <name>ПеремещениеТоваров</name>
      <description>Перемещение товаров</description>
    </items>
    <items>
      <name>ВозвратПеремещение</name>
      <description>Переміщення (логістика)</description>
    </items>
    <items>
      <name>Переоценки</name>
      <description>Переоценки</description>
    </items>
    <items>
      <name>Пересортица</name>
      <description>Пересортиця</description>
    </items>
    <items>
      <name>Печать</name>
      <description>Печать</description>
    </items>
    <items>
      <name>ВозвратТоваров</name>
      <description>Повернення постачальнику</description>
    </items>
    <items>
      <name>Посетители</name>
      <description>Посетители</description>
    </items>
    <items>
      <name>ПриемПоЗаказу</name>
      <description>Поступление товаров</description>
    </items>
    <items>
      <name>ПриемPKG</name>
      <description>Прием PKG</description>
    </items>
    <items>
      <name>ПриемПоПриходу</name>
      <description>Прием по приходу</description>
    </items>
    <items>
      <name>ПриходУход</name>
      <description>Приход уход</description>
    </items>
    <items>
      <name>Рекламация</name>
      <description>Рекламация</description>
    </items>
    <items>
      <name>Списание2</name>
      <description>Списание</description>
    </items>
    <items>
      <name>ЗаданиеТНП</name>
      <description>Термін придатності</description>
    </items>
    <items>
      <name>Уведомление</name>
      <description>Уведомление</description>
    </items>
    <items>
      <name>Уценка</name>
      <description>Уценка</description>
    </items>
    <items>
      <name>Фото</name>
      <description>Фото</description>
    </items>
    <items>
      <name>ФотоСчетчика</name>
      <description>Фото счетчика</description>
    </items>
  </predefined>
</mdclass:Catalog>

TSD_TK/src/DataProcessors/ПанельМеню/Forms/ФормаФотоСчетчика/Module.bsl
&НаКлиенте
Перем ВыполняетсяЗакрытие;




&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек(Отказ)
	
	
	Параметры.Свойство("ТипДокумента",ТипДокумента);
	
	Параметры.Свойство("ДокументUUID",ДокументUUID);
	
	БазаПодключения = Перечисления.БазаПодключения.ТК;
	
	ИспользуетсяАсинхронныйСканер = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяАсинхронныйСканерШтрихкодов();
	
	Инициализирован = НЕ ПустаяСтрока(ПараметрыСеанса.Подразделение);	
	ПользовательИнициализирован = НЕ ПустаяСтрока(ПараметрыСеанса.Сотрудник);
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
	ОбновитьПодразделение();
	ОбновитьСотрудника();
	
	УстановитьДоступностьПоНастройкам();	
	

	ЗаполнитьДанныеПоСчетчикам(Отказ);
	
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоСчетчикам(Отказ)
	Если НЕ Инициализирован Тогда
		Возврат;
	КонецЕсли;

	ДанныеДокумента = ИнтеграцияТК_ВызовСервера.ПолучитьMarketDoc(ТипДокумента.ИмяПредопределенныхДанных);
	Если  ДанныеДокумента.Результат = Ложь Тогда
		Отказ = Истина;
		Если НЕ ПустаяСтрока(ДанныеДокумента.ОписаниеОшибки) Тогда
			Сообщить(ДанныеДокумента.ОписаниеОшибки);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	сч = 1;
	Для Каждого СтрСч Из ДанныеДокумента.Ответ Цикл
		нСтр = ТаблицаСчетчики.Добавить();
		нСтр.Номер = сч;
		ЗаполнитьЗначенияСвойств(нСтр,СтрСч);
		сч =  сч + 1;
	КонецЦикла;
	
	
	
КонецПроцедуры


&НаСервере
Процедура УстановитьДоступностьПоНастройкам()
	
	ЕстьОборудованиеСканирования = ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования());
	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Видимость",
	(ЕстьОборудованиеСканирования И НЕ ИспользуетсяАсинхронныйСканер) И Инициализирован И ПользовательИнициализирован И ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК()
	);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ТаблицаСчетчики,ГруппаФото,ДекорацияСчетчик,Сохранить", "Видимость", ПользовательИнициализирован);

	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДобавитьВдокумент", "Видимость",
	//ВводкКоличества
	//);

	//
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Страницы", "Видимость",
	//Инициализирован И ПользовательИнициализирован  И ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК()
	//);
	//
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Контрагент", "Видимость",
	//Инициализирован И ПользовательИнициализирован  И ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК() И НЕ КонтрагентВыбран
	//);
	
	
КонецПроцедуры


&НаСервере
Процедура ОбновитьПодразделение()
	
	
	Если ПустаяСтрока(ПараметрыСеанса.Подразделение) Тогда
		Элементы.СообщениеИнициализации.Заголовок = "Устройство не инициализировано";
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеИнициализации");
		Инициализирован = Ложь;
	Иначе
		Элементы.СообщениеИнициализации.Заголовок = ПараметрыСеанса.Подразделение;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "СообщениеИнициализации");
		Инициализирован = Истина;

	КонецЕсли;
	
	УстановитьДоступностьПоНастройкам();
	
	

	
КонецПроцедуры


&НаСервере
Процедура ОбновитьСотрудника()
	
	Если ПустаяСтрока(ПараметрыСеанса.Сотрудник) Тогда
		Элементы.СообщениеИнициализацииПользователя.Заголовок = "Пользователь не инициализирован";
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеИнициализацииПользователя");
		Сотрудник = "";
		ПользовательИнициализирован = Ложь;
		
	Иначе
		Если ПараметрыСеанса.Сотрудник <> Элементы.СообщениеИнициализацииПользователя.Заголовок Тогда
			Сотрудник = "";
		КонецЕсли;
		

		Элементы.СообщениеИнициализацииПользователя.Заголовок = ПараметрыСеанса.Сотрудник;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "СообщениеИнициализацииПользователя");
		ПользовательИнициализирован = Истина;
		
	КонецЕсли;
	
	
	
	
	УстановитьДоступностьПоНастройкам();

	
КонецПроцедуры







&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	

	НастроитьФормуПоЗначениямНастроек(Отказ);
	НастроитьФормуПоОриентацииЭкрана();

КонецПроцедуры






///События формы
&НаКлиенте
Процедура СообщениеИнициализацииНажатие(Элемент)
	ОткрытьФорму("Обработка.Сервис.Форма.Инициализация", , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры


&НаКлиенте
Процедура СообщениеИнициализацииПользователяНажатие(Элемент)
	ДополнительныеПараметры = Новый Структура;
	ДопПарметрыФормы = Новый Структура;
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриходУход") Тогда
		ДопПарметрыФормы.Вставить("СотрудникЗУП");
	КонецЕсли;
	опЗакрытие = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияВводаСотрудника",ЭтаФорма,ДополнительныеПараметры);
	ОткрытьФорму("Обработка.Сервис.Форма.ИнициализацияСотрудник",ДопПарметрыФормы, ЭтаФорма,,,,опЗакрытие, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияВводаСотрудника(Результат,ДополнительныеПараметры)Экспорт 
	
	
КонецПроцедуры


&НаКлиенте
Процедура Сканировать(Команда)
	ИдетПроцессСканирования = Истина;
	ОткрытьДиалогСканирования();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	АсинхронныйСканерИнициализирован = ПодключаемоеОборудованиеВызовСервера.СканерШтрихкодовИнициализирован();

	Если ИспользуетсяАсинхронныйСканер И АсинхронныйСканерИнициализирован = Ложь Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ПодключитьАссинхронныйСканерШтрихкодов", 0.1, Истина);
	КонецЕсли;

	ВыполняетсяЗакрытие = Ложь;


КонецПроцедуры







&НаКлиенте
Процедура ОткрытьДиалогСканирования()
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
	ДополнительныеПараметры.Вставить("ЗаголовокСканирования", НСтр("ru = 'Считайте штрих-код'"));
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
	
КонецПроцедуры


&НаКлиенте
Процедура Подключаемый_ПодключитьАссинхронныйСканерШтрихкодов()
	
	ИнициализироватьАсинхронныйСканер();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьАсинхронныйСканер()
	
	ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
		
	Если ВыполняетсяЗакрытие Тогда
		ОбщегоНазначенияКлиентСервер.ОчиститьСотрудника();
	Иначе
		Отказ = Истина;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение",ЭтотОбъект),"Закрыть документ?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса,ДопоплнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВыполняетсяЗакрытие = Истина;
		Закрыть();
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
		ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);
		
	ИначеЕсли ИмяСобытия = "ИзмененоПодразделение" Тогда
		
		ОбновитьПодразделение();
		
	ИначеЕсли ИмяСобытия = "ИзмененСотрудник" Тогда
		
		ОбновитьСотрудника();
		
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт
	Если ПустаяСтрока(ПолученныйШтрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПользовательИнициализирован Тогда
		
		Результат	= ИнтеграцияТК_Клиент.ПолучитьСотрудника(ПолученныйШтрихкод);
		
		
		Если Результат.Результат Тогда
			Оповестить("ИзмененСотрудник");
		Иначе
			Сообщить("Необходима авторизация пользователя (ТКС)");
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьФото(Команда)
	
	#Если МобильноеПриложениеКлиент Тогда 
		ТекСтрока = Команда.ИспользуемаяТаблица.ТекущиеДанные;
		Если ТекСтрока = Неопределено Тогда
			Сообщить("Потрібно вибрати лічильник");
			Возврат;
		 КонецЕсли;
		 
		Если СредстваМультимедиа.ПоддерживаетсяФотоснимок(ТипКамерыУстройства.Задняя) Тогда
			Результат =  СредстваМультимедиа.СделатьФотоснимок(ТипКамерыУстройства.Задняя,,100,Истина,,Новый ОтметкаНаФотоснимке(Истина,,));
			Если НЕ Результат = Неопределено Тогда
								
				Двоичные = Результат.ПолучитьДвоичныеДанные();
				ПутьФото = ПоместитьВоВременноеХранилище(Двоичные,Новый УникальныйИдентификатор);
				ТекСтрока.Фото = ПутьФото;
				ТекСтрока.ЕстьФото = Истина;
				
				
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаЕстьФото", "Видимость",  Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаНетФото", "Видимость",  Ложь);
			Иначе
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаЕстьФото", "Видимость",  Ложь);
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаНетФото", "Видимость",  Истина);

			КонецЕсли;
			
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаСчетчикиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаСчетчикиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаСчетчики.ТекущиеДанные;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаЕстьФото", "Видимость",  ТекущиеДанные.ЕстьФото);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаНетФото", "Видимость",  НЕ ТекущиеДанные.ЕстьФото);
	ПутьФото = ТекущиеДанные.Фото;
	Элементы.ДекорацияСчетчик.Заголовок = ТекущиеДанные.Счетчик  +" "+Формат(ТекущиеДанные.Показание,"ЧЦ=15; ЧС=; ЧН=Введіть!; ЧГ=");
	НомерСтрокиДляПодсветки = ТекущиеДанные.Номер;
КонецПроцедуры


&НаСервере
Функция СохранитьНаСервере()
	
	СтруктураДокумента = Новый Структура();
	СтруктураДокумента.Вставить("UUID_Сотрудник", ПараметрыСеанса.Сотрудник_ID);
	СтруктураДокумента.Вставить("ДокументUUID", ДокументUUID);
	
	мСчетчики = Новый Массив;
	
	Для Каждого стрСчетчики Из ТаблицаСчетчики Цикл 
		Если стрСчетчики.ЕстьФото Тогда
			СодержимоеФайла	 = Base64Строка(ПолучитьИзВременногоХранилища(стрСчетчики.Фото));
			мСчетчики.Добавить(Новый Структура("СчетчикИД,Фото,Показание",стрСчетчики.СчетчикИД,СодержимоеФайла,стрСчетчики.Показание));
		КонецЕсли;
	КонецЦикла;
	
	СтруктураДокумента.Вставить("Счетчики", мСчетчики);

	Рез = ИнтеграцияТК_ВызовСервера.ПередатьДокументНаСервер(СтруктураДокумента,ТипДокумента);
	
	Возврат Рез;

КонецФункции


&НаКлиенте
Процедура Сохранить(Команда)
	
	стрВопрос = "";
	счВсего = 0;
	счБезФото = 0;
	счБезПоказания = 0;
	Для Каждого стрСчетчик  Из ТаблицаСчетчики Цикл 
		счВсего = счВсего + 1;
		Если стрСчетчик.ЕстьФото = Ложь Тогда
			счБезФото = счБезФото +1;
			стрВопрос = стрВопрос + "Лічильник "+  стрСчетчик.Счетчик + " немає фото"+Символы.ПС;
		КонецЕсли;
		Если стрСчетчик.ЕстьНомер = Ложь Тогда
			счБезПоказания = счБезПоказания +1;
			стрВопрос = стрВопрос + "Лічильник "+  стрСчетчик.Счетчик + "  немає свідчення"+Символы.ПС;

		КонецЕсли;
		
	КонецЦикла;
	Если счВсего = счБезФото ИЛИ счВсего = счБезПоказания Тогда
		Сообщить(стрВопрос);
		Возврат;
	КонецЕсли;

	ПоказатьВопрос(Новый ОписаниеОповещения("ОповещенияОтправки",ЭтотОбъект),стрВопрос +"Вивантажити дані на сервер?",РежимДиалогаВопрос.ДаНет);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещенияОтправки(Результат, Параметры)Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыгрузитьДокументНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДокументНаКлиенте()
	
	Рез = СохранитьНаСервере();
	Если Рез.Результат Тогда
		Сообщить("Фото вивантажено успішно");
		Оповестить("ОбновитьЗадания");

		ВыполняетсяЗакрытие = Истина;
		Закрыть();
	Иначе
		Если ПустаяСтрока(Рез.ОписаниеОшибки) Тогда
			Сообщить("Помилка надсилання фото!");
		Иначе
			Сообщить(Рез.ОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСчетчикНажатие(Элемент)
	ТекущиеДанные = Элементы.ТаблицаСчетчики.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран счетчик");
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура("ТекСчетчик",ТекущиеДанные);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества", ЭтотОбъект,ДопПараметры);
	ПоказатьВводЧисла(Оповещение, ТекущиеДанные.Показание, "Введите показания "+ТекущиеДанные.Счетчик,,0);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаКоличества(Число, Параметры) Экспорт
    Если НЕ Число = Неопределено Тогда
		Параметры.ТекСчетчик.Показание = Число;
		Параметры.ТекСчетчик.ЕстьНомер = Истина;
		
		Элементы.ДекорацияСчетчик.Заголовок = Параметры.ТекСчетчик.Счетчик +" "+Формат(Число,"ЧЦ=15; ЧС=; ЧН=Введіть!; ЧГ=");
		
    КонецЕсли;
КонецПроцедуры;
